tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/aux_case/mapFieldsTesting/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
11961
(
0.0144362
-0.0338699
0.377019
0.0225547
-0.0731983
-0.0943868
-0.124637
-0.00286019
...
)
;

boundaryField
{
    airfoil
    {
        type            zeroGradient;
    }
    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
